### 데이터프레임 합치기

- 데이터가 여러 군데 나누어져 있을 때 하나로 합치거나 데이터를 연결해야 하는 경우
- concat(), merge(), join()

#### 데이터프레임 연결

- 서로 다른 데이터프레임들의 구성 형태와 속성이 균일하다면, 행 또는 열 중에 어느 한 방향으로 이어 붙여도 데이터의 일관성을 유지할 수 있음
- 기존 데이터프레임의 형태를 유지하면서 이어 붙이는 개념으로 판다스 count() 함수 활용

In [ ]:
# 데이터프레임 연결
pandas.count(데이터프레임의 리스트)

- count() 함수에 데이터프레임을 원소로 갖는 리스트를 전달하면 여러 개의 데이터프레임을 서로 연결
- 축방향을 지정하지 않으면 기본 옵션(axis = 0)이 적용되어 위 아래 행 방향으로 연결
- 각 데이터프레임의 행 인덱스는 본래 형태를 유지
- 열 이름에 대해서는 join = 'outer' 옵션이 기본 적용         
-> 두 열 이름의 합집합으로 연결 데이터프레임의 열 이름 배열을 구성
- join = 'inner' 옵션의 경우 데이터프레임에 공통으로 속하는 교집합이 기준

In [2]:
# 6.11_df_concat.py

# 라이브러리 불러오기
import pandas as pd

# 데이터프레임 만들기
df1 = pd.DataFrame({'a' : ['a0', 'a1', 'a2', 'a3'],
                    'b' : ['b1', 'b2', 'b3', 'b4'],
                    'c' : ['c1', 'c2', 'c3', 'c4']},
                    index = [0, 1, 2, 3])
df2 = pd.DataFrame({'a' : ['a2', 'a3', 'a4', 'a5'],
                    'b' : ['b2', 'b3', 'b4', 'b5'],
                    'c' : ['c2', 'c3', 'c4', 'c5'],
                    'd' : ['d2', 'd3', 'd4', 'd5']},
                    index = [2, 3, 4, 5])

print(df1, '\n')
print(df2, '\n')

# 2개의 데이터프레임을 위 아래 행 방향으로 이어 붙이듯 연결하기
result1 = pd.concat([df1, df2])
print(result1, '\n')

    a   b   c
0  a0  b1  c1
1  a1  b2  c2
2  a2  b3  c3
3  a3  b4  c4

    a   b   c   d
2  a2  b2  c2  d2
3  a3  b3  c3  d3
4  a4  b4  c4  d4
5  a5  b5  c5  d5

    a   b   c    d
0  a0  b1  c1  NaN
1  a1  b2  c2  NaN
2  a2  b3  c3  NaN
3  a3  b4  c4  NaN
2  a2  b2  c2   d2
3  a3  b3  c3   d3
4  a4  b4  c4   d4
5  a5  b5  c5   d5

In [3]:
# ignore_index = True 옵션 설정 
# -> 기존 행 인덱스를 무시하고 새로운 행 인덱스 설정
result2 = pd.concat([df1, df2], ignore_index = True)
print(result2)

    a   b   c    d
0  a0  b1  c1  NaN
1  a1  b2  c2  NaN
2  a2  b3  c3  NaN
3  a3  b4  c4  NaN
4  a2  b2  c2   d2
5  a3  b3  c3   d3
6  a4  b4  c4   d4
7  a5  b5  c5   d5

- axis = 1 옵션을 사용하면 데이터프레임을 좌우 열 방향으로 연결
- 기존 열 이름 배열이 그대로 유지
- 연결되는 데이터프레임의 행 인덱스는, join = 'outer' 옵션이 기본값으로 적용되어 각 데이터프레임의 행 인덱스들의 합집합으로 고성

In [4]:
# 2개의 데이터프레임을 좌우 열 방향으로 이어 붙이듯 연결
result3 = pd.concat([df1, df2], axis = 1)
print(result3, '\n')

     a    b    c    a    b    c    d
0   a0   b1   c1  NaN  NaN  NaN  NaN
1   a1   b2   c2  NaN  NaN  NaN  NaN
2   a2   b3   c3   a2   b2   c2   d2
3   a3   b4   c4   a3   b3   c3   d3
4  NaN  NaN  NaN   a4   b4   c4   d4
5  NaN  NaN  NaN   a5   b5   c5   d5

- join = 'inner' 옵션을 설정하면 연결할 데이터프레임들의 행 인덱스의 교집합을 기준으로 사용

In [6]:
# join = 'inner' 옵션 적용하기(교집합)
result3_in = pd.concat([df1, df2], axis = 1, join = 'inner')
print(result3_in, '\n')

    a   b   c   a   b   c   d
2  a2  b3  c3  a2  b2  c2  d2
3  a3  b4  c4  a3  b3  c3  d3

- 데이터프레임과 시리즈를 좌우 열 방향으로 연결도 가능 => 데이터프레임에 열을 추가하는 것과 같음
- 시리즈의 이름의 데이터프레임의 열 이름으로 반환
- 데이터프레임의 행 인덱스와 시리즈의 인덱스가 같아야 함
- 공통 인덱스가 없을 경우 NaN 값이 입력됨

In [8]:
# 시리즈 만들기
sr1 = pd.Series(['e0', 'e1', 'e2', 'e3'], name = 'e')
sr2 = pd.Series(['f0', 'f1', 'f2'], name = 'f', index = [3, 4, 5])
sr3 = pd.Series(['g0', 'g1', 'g2', 'g3'], name = 'g')

# df1과 sr1을 좌우 열 방향으로 연결하기
result4 = pd.concat([df1, sr1], axis = 1)
print(result4, '\n')

# df2와 sr2를 좌우 열 방향으로 연결하기
result5 = pd.concat([df2, sr2], axis = 1, sort = True)
print(result5)

    a   b   c   e
0  a0  b1  c1  e0
1  a1  b2  c2  e1
2  a2  b3  c3  e2
3  a3  b4  c4  e3

    a   b   c   d    f
2  a2  b2  c2  d2  NaN
3  a3  b3  c3  d3   f0
4  a4  b4  c4  d4   f1
5  a5  b5  c5  d5   f2

- 시리즈들로 만든 리스트를 concat() 함수에 전달하면 시리즈가 서로 연결됨
- axis = 1 옵션을 적용하면 좌우 열 방향으로 연결하여 데이터프레임이 됨
- axis = 0 옵션을 적용하면 위 아래 방향으로 길게 연결되어 하나의 시리즈가 됨

In [9]:
# sr1과 sr3을 좌우 열 방향으로 연결하기
result6 = pd.concat([sr1, sr3], axis = 1)
print(result6, '\n')

result7 = pd.concat([sr1, sr3], axis = 0)
print(result7, '\n')

    e   g
0  e0  g0
1  e1  g1
2  e2  g2
3  e3  g3

0    e0
1    e1
2    e2
3    e3
0    g0
1    g1
2    g2
3    g3
dtype: object

#### 데이터프레임 병합

- concat(): 여러 데이터프레임을 이어 붙이듯 연결하는 것
- merge(): SQL의 join 명령과 비슷한 방식; 어떤 기준에 의해 두 데이터프레임을 병합
- 키(key): 기준이 되는 열이나 인덱스
- 키가 되는 열이나 인덱스는 반드시 양쪽 데이터프레임에 모두 존재해야 함

In [14]:
# 6.12_df_merge.py

# 라이브러리 불러오기
import pandas as pd

# IPython 디스플레이 설정 변경
pd.set_option('display.max_columns', 10) # 출력할 최대 열의 개수
pd.set_option('display.max_colwidth', 20) # 출력할 열의 너비
pd.set_option('display.unicode.east_asian_width', True) # 유니코드 사용 너비 조정

# 주식 데이터를 가져와서 데이터프레임 만들기
df1 = pd.read_excel('/Users/youju/Downloads/5674-833_4th/part6/stock price.xlsx', engine = 'openpyxl')
df2 = pd.read_excel('/Users/youju/Downloads/5674-833_4th/part6/stock valuation.xlsx', engine = 'openpyxl')

display(df1)
print('\n')
display(df2)

       id    stock_name          value   price
0  128940      한미약품   59385.666667  421000
1  130960        CJ E&M   58540.666667   98900
2  138250    엔에스쇼핑   14558.666667   13200
3  139480        이마트  239230.833333  254500
4  142280  녹십자엠에스     468.833333   10200
5  145990        삼양사   82750.000000   82000
6  185750        종근당   40293.666667  100500
7  192400    쿠쿠홀딩스  179204.666667  177500
8  199800          툴젠   -2514.333333  115400
9  204210  모두투어리츠    3093.333333    3475

       id              name           eps     bps        per       pbr
0  130960            CJ E&M   6301.333333   54068  15.695091  1.829178
1  136480              하림    274.166667    3551  11.489362  0.887074
2  138040    메리츠금융지주   2122.333333   14894   6.313806  0.899691
3  139480            이마트  18268.166667  295780  13.931338  0.860437
4  145990            삼양사   5741.000000  108090  14.283226  0.758627
5  161390        한국타이어   5648.500000   51341   7.453306  0.820007
6  181710   NHN엔터테인먼트   2110.166667   78434  30.755864  0.827447
7  185750            종근당   3990.333333   40684  25.185866  2.470259
8  204210      모두투어리츠     85.166667    5335  40.802348  0.651359
9  207940  삼성바이오로직스   4644.166667   60099  89.790059  6.938551

- on = None 옵션과 how = 'inner' 옵션이 기본값으로 적용
- on = None 옵션은 두 데이터프레임에 공통으로 속하는 모든 열을 기준(키)으로 병합
- how = 'inner' 옵션은 기준이 되는 열의 데이터가 양쪽 데이터프레임에 공통으로 존재하는 교집합일 경우에만 추출

In [15]:
# 데이터프레임 합치기 - 교집합
merge_inner = pd.merge(df1, df2)
display(merge_inner)

,id,stock_name,value,price,name,eps,bps,per,pbr
0,130960,CJ E&M,58540.666667,98900,CJ E&M,6301.333333,54068,15.695091,1.829178
1,139480,이마트,239230.833333,254500,이마트,18268.166667,295780,13.931338,0.860437
2,145990,삼양사,82750.000000,82000,삼양사,5741.000000,108090,14.283226,0.758627
3,185750,종근당,40293.666667,100500,종근당,3990.333333,40684,25.185866,2.470259
4,204210,모두투어리츠,3093.333333,3475,모두투어리츠,85.166667,5335,40.802348,0.651359

- on = 'id' 옵션과 how = 'outer' 옵션 설정
- on = 'id' 옵션은 두 데이터프레임의 공통 열 중에서 'id' 열을 키로 병합
- how = 'outer' 옵션은 기준이 되는 'id' 열의 데이터가 데이터프레임 중 어느 한쪽에만 속하더라도 포함
- 'id' 열을 기준으로 모든 종목의 데이터가 포함
- 어느 한 쪽이라도 데이터가 없는 열에는 NaN 지정

In [16]:
# 데이터프레임 합치기 - 합집합
merge_outer = pd.merge(df1, df2, how = 'outer', on = 'id')
display(merge_outer)

,id,stock_name,value,price,name,eps,bps,per,pbr
0,128940,한미약품,59385.666667,421000.0,NaN,NaN,NaN,NaN,NaN
1,130960,CJ E&M,58540.666667,98900.0,CJ E&M,6301.333333,54068.0,15.695091,1.829178
2,138250,엔에스쇼핑,14558.666667,13200.0,NaN,NaN,NaN,NaN,NaN
3,139480,이마트,239230.833333,254500.0,이마트,18268.166667,295780.0,13.931338,0.860437
4,142280,녹십자엠에스,468.833333,10200.0,NaN,NaN,NaN,NaN,NaN
5,145990,삼양사,82750.000000,82000.0,삼양사,5741.000000,108090.0,14.283226,0.758627
6,185750,종근당,40293.666667,100500.0,종근당,3990.333333,40684.0,25.185866,2.470259
7,192400,쿠쿠홀딩스,179204.666667,177500.0,NaN,NaN,NaN,NaN,NaN
8,199800,툴젠,-2514.333333,115400.0,NaN,NaN,NaN,NaN,NaN
9,204210,모두투어리츠,3093.333333,3475.0,모두투어리츠,85.166667,5335.0,40.802348,0.651359
10,136480,NaN,NaN,NaN,하림,274.166667,3551.0,11.489362,0.887074
11,138040,NaN,NaN,NaN,메리츠금융지주,2122.333333,14894.0,6.313806,0.899691
12,161390,NaN,NaN,NaN,한국타이어,5648.500000,51341.0,7.453306,0.820007
13,181710,NaN,NaN,NaN,NHN엔터테인먼트,2110.166667,78434.0,30.755864,0.827447
14,207940,NaN,NaN,NaN,삼성바이오로직스,4644.166667,60099.0,89.790059,6.938551

- how = 'left' 옵션을 설정하면 왼쪽 데이터프레임의 키 열에 속하는 데이터 값을 기준으로 병합
- left_on과 right_on 옵션을 사용하여 좌우 데이터프레임에 각각 다르게 키를 지정 가능

In [18]:
# 데이터프레임 합치기 - 왼쪽 데이터프레임 기준, 키 값 부리
merge_left = pd.merge(df1, df2, how = 'left', left_on = 'stock_name', right_on = 'name')
display(merge_left)

,id_x,stock_name,value,price,id_y,name,eps,bps,per,pbr
0,128940,한미약품,59385.666667,421000,NaN,NaN,NaN,NaN,NaN,NaN
1,130960,CJ E&M,58540.666667,98900,130960.0,CJ E&M,6301.333333,54068.0,15.695091,1.829178
2,138250,엔에스쇼핑,14558.666667,13200,NaN,NaN,NaN,NaN,NaN,NaN
3,139480,이마트,239230.833333,254500,139480.0,이마트,18268.166667,295780.0,13.931338,0.860437
4,142280,녹십자엠에스,468.833333,10200,NaN,NaN,NaN,NaN,NaN,NaN
5,145990,삼양사,82750.000000,82000,145990.0,삼양사,5741.000000,108090.0,14.283226,0.758627
6,185750,종근당,40293.666667,100500,185750.0,종근당,3990.333333,40684.0,25.185866,2.470259
7,192400,쿠쿠홀딩스,179204.666667,177500,NaN,NaN,NaN,NaN,NaN,NaN
8,199800,툴젠,-2514.333333,115400,NaN,NaN,NaN,NaN,NaN,NaN
9,204210,모두투어리츠,3093.333333,3475,204210.0,모두투어리츠,85.166667,5335.0,40.802348,0.651359

- how = 'right' 옵션
- 오른쪽 데이터프레임의 키 열을 기준으로 추출

In [19]:
# 데이터프레임 합치기 - 오른쪽 데이터프레임 기준, 키 값 분리
merge_right = pd.merge(df1, df2, how = 'right', left_on = 'stock_name', right_on = 'name')
display(merge_right)

,id_x,stock_name,value,price,id_y,name,eps,bps,per,pbr
0,130960.0,CJ E&M,58540.666667,98900.0,130960,CJ E&M,6301.333333,54068,15.695091,1.829178
1,NaN,NaN,NaN,NaN,136480,하림,274.166667,3551,11.489362,0.887074
2,NaN,NaN,NaN,NaN,138040,메리츠금융지주,2122.333333,14894,6.313806,0.899691
3,139480.0,이마트,239230.833333,254500.0,139480,이마트,18268.166667,295780,13.931338,0.860437
4,145990.0,삼양사,82750.000000,82000.0,145990,삼양사,5741.000000,108090,14.283226,0.758627
5,NaN,NaN,NaN,NaN,161390,한국타이어,5648.500000,51341,7.453306,0.820007
6,NaN,NaN,NaN,NaN,181710,NHN엔터테인먼트,2110.166667,78434,30.755864,0.827447
7,185750.0,종근당,40293.666667,100500.0,185750,종근당,3990.333333,40684,25.185866,2.470259
8,204210.0,모두투어리츠,3093.333333,3475.0,204210,모두투어리츠,85.166667,5335,40.802348,0.651359
9,NaN,NaN,NaN,NaN,207940,삼성바이오로직스,4644.166667,60099,89.790059,6.938551

- merge() 함수를 불린 인덱싱과 함께 사용하면 원하는 데이터 추출 가능
- on = None, how = 'inner' 옵션이 기본 값으로 적용.          
-> 두 데이터프레임에 공통으로 존재하는 열(id)을 기준으로 기준 열들의 값이 양쪽에 공통으로 존재하는 데이터가 추출

In [20]:
# 불린 인덱싱과 결합하여 원하는 데이터 찾기
price = df1[df1['price'] < 50000]
print(price.head())
print('\n')

value = pd.merge(price, df2)
print(value)

       id    stock_name         value  price
2  138250    엔에스쇼핑  14558.666667  13200
4  142280  녹십자엠에스    468.833333  10200
9  204210  모두투어리츠   3093.333333   3475


       id    stock_name        value  price          name        eps   bps  \
0  204210  모두투어리츠  3093.333333   3475  모두투어리츠  85.166667  5335

         per       pbr
0  40.802348  0.651359

#### 데이터프레임 결합

- 판다스 join() 메서드는 merge() 함수를 기반으로 만들어졌기 때문에 기본 작동 방식이 서로 비슷함
- join() 메서드는 두 데이터프레임의 행 인덱스를 기준으로 결합
- on = keys 옵션을 설정하면 행 인덱스 대신 다른 열을 기준으로 결합하는 것이 가능

In [ ]:
# 행 인덱스 기준으로 결합
DataFrame1.join(DataFrame2, how = 'left')

In [21]:
# 6.13_df_join.py

# 라이브러리 불러오기
import pandas as pd

# IPython 디스플레이 설정 변경
pd.set_option('display.max_columns', 10) # 출력할 최대 열의 개수
pd.set_option('display.max_colwidth', 20) # 출력할 열의 너비
pd.set_option('display.unicode.east_asian_width', True) # 유니코드 사용 너비 조정

# 주식 데이터를 가져와서 데이터프레임 만들기
df1 = pd.read_excel('/Users/youju/Downloads/5674-833_4th/part6/stock price.xlsx', index_col = 'id', engine = 'openpyxl')
df2 = pd.read_excel('/Users/youju/Downloads/5674-833_4th/part6/stock valuation.xlsx', index_col = 'id', engine = 'openpyxl')

# 데이터프레임 결합(join)
df3 = df1.join(df2)
print(df3)

          stock_name          value   price          name           eps  \
id
128940      한미약품   59385.666667  421000           NaN           NaN
130960        CJ E&M   58540.666667   98900        CJ E&M   6301.333333
138250    엔에스쇼핑   14558.666667   13200           NaN           NaN
139480        이마트  239230.833333  254500        이마트  18268.166667
142280  녹십자엠에스     468.833333   10200           NaN           NaN
145990        삼양사   82750.000000   82000        삼양사   5741.000000
185750        종근당   40293.666667  100500        종근당   3990.333333
192400    쿠쿠홀딩스  179204.666667  177500           NaN           NaN
199800          툴젠   -2514.333333  115400           NaN           NaN
204210  모두투어리츠    3093.333333    3475  모두투어리츠     85.166667

             bps        per       pbr
id
128940       NaN        NaN       NaN
130960   54068.0  15.695091  1.829178
138250       NaN        NaN       NaN
139480  295780.0  13.931338  0.860437
142280       NaN        NaN       NaN
145990  108090.0  14.283226  0.758627
185750   40684.0  25.185866  2.470259
192400       NaN        NaN       NaN
199800       NaN        NaN       NaN
204210    5335.0  40.802348  0.651359

how = 'inner' 옵션을 적용해서 두 데이터프레임에 공통으로 존재하는 행 인덱스를 기준으로 추출

In [22]:
# 데이터프레임 결합(join) - 교집합
df4 = df1.join(df2, how = 'inner')
print(df4)

          stock_name          value   price          name           eps  \
id
130960        CJ E&M   58540.666667   98900        CJ E&M   6301.333333
139480        이마트  239230.833333  254500        이마트  18268.166667
145990        삼양사   82750.000000   82000        삼양사   5741.000000
185750        종근당   40293.666667  100500        종근당   3990.333333
204210  모두투어리츠    3093.333333    3475  모두투어리츠     85.166667

           bps        per       pbr
id
130960   54068  15.695091  1.829178
139480  295780  13.931338  0.860437
145990  108090  14.283226  0.758627
185750   40684  25.185866  2.470259
204210    5335  40.802348  0.651359

### 그룹 연산

- 특정 기준을 적용하여 몇 개의 그룹으로 분할하여 처리하는 것

- 1단계) 분할(split): 데이터를 특정 조건에 의해 분할
- 2단계) 적용(apply): 데이터를 집계, 변환, 필터링하는데 필요한 메서드 적용
- 3단계) 결합(conbine): 2단계의 처리 결과를 하나로 결합

#### 그룹 객체 만들기(분할 단계)

##### 1개 열을 기준으로 그룹화

- groupby() 메서드는 데이터프레임의 특정 열을 기준으로 데이터프레임을 분할하여 그룹 객체를 반환
- 기준이 되는 열을 1개도 가능하고, 여러 열을 리스트로 입력할 수도 있음

In [ ]:
# 그룹 연산(분할)
DataFrame객체.groupby(기준이 되는 열)

In [31]:
# 6.14_df_groupby.py

# 라이브러리 불러오기
import pandas as pd
import seaborn as sns

# titanic 데이터셋에서 age, sex 등 5개 열을 선택하여 데이터프레임 만들기
titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['age', 'sex', 'class', 'fare', 'survived']]

print('승객 수:', len(df))
print(df.head())
print('\n')

# class 열을 기준으로 분할
grouped = df.groupby(['class'])
print(grouped)

승객 수: 891
    age     sex  class     fare  survived
0  22.0    male  Third   7.2500         0
1  38.0  female  First  71.2833         1
2  26.0  female  Third   7.9250         1
3  35.0  female  First  53.1000         1
4  35.0    male  Third   8.0500         0


<pandas.core.groupby.generic.DataFrameGroupBy object at 0x16a854e10>

In [33]:
# 그룹 객체를 iteration으로 출력: head() 메서드로 첫 5행만을 출력
for key, group in grouped:
    print('* key:', key)
    print('* number:', len(group))
    print(group.head())
    print('\n')

* key: First
* number: 216
     age     sex  class     fare  survived
1   38.0  female  First  71.2833         1
3   35.0  female  First  53.1000         1
6   54.0    male  First  51.8625         0
11  58.0  female  First  26.5500         1
23  28.0    male  First  35.5000         1


* key: Second
* number: 184
     age     sex   class     fare  survived
9   14.0  female  Second  30.0708         1
15  55.0  female  Second  16.0000         1
17   NaN    male  Second  13.0000         1
20  35.0    male  Second  26.0000         0
21  34.0    male  Second  13.0000         1


* key: Third
* number: 491
    age     sex  class     fare  survived
0  22.0    male  Third   7.2500         0
2  26.0  female  Third   7.9250         1
4  35.0    male  Third   8.0500         0
5   NaN    male  Third   8.4583         0
7   2.0    male  Third  21.0750         0

/var/folders/t0/85xt099562dflgf6nvxdqgl00000gn/T/ipykernel_29911/3187552086.py:2: FutureWarning: In a future version of pandas, a length 1 tuple will be returned when iterating over a groupby with a grouper equal to a list of length 1. Don't supply a list with a single grouper to avoid this warning.
  for key, group in grouped:

- 생성한 그룹 객체(grouped)에 연산 메서드 적용 가능

In [34]:
# 연산 메서드 적용
average = grouped.mean()
print(average)

              age       fare  survived
class
First   38.233441  84.154687  0.629630
Second  29.877630  20.662183  0.472826
Third   25.140620  13.675550  0.242363

/var/folders/t0/85xt099562dflgf6nvxdqgl00000gn/T/ipykernel_29911/1669890616.py:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  average = grouped.mean()

In [36]:
# 개별 그룹 선택하기
group3 = grouped.get_group('Third')
print(group3.head())

    age     sex  class     fare  survived
0  22.0    male  Third   7.2500         0
2  26.0  female  Third   7.9250         1
4  35.0    male  Third   8.0500         0
5   NaN    male  Third   8.4583         0
7   2.0    male  Third  21.0750         0

##### 여러 열을 기준으로 그룹화

- 여러 개의 기준 값을 사용하기 때문에 반환되는 그룹 객체의 인덱스는 다중 구조를 가짐

In [ ]:
# 그룹 연산(분할)
DataFrame객체.groupby(기준이 되는 열의 리스트)

- groupby() 메서드에 두 열을 인자로 전달하면, 두 열이 갖는 원소의 값들로 만들 수 있는 모든 조합으로 키를 생성
- 조합된 키를 기준으로 그룹 객체 생성
- 가능합 조합은 튜플로 지정

In [37]:
# class 열, sex 열을 기준으로 분할
grouped_two = df.groupby(['class', 'sex'])

# grouped_two 그룹 객체를 iteration으로 출력
for key, group in grouped_two:
    print('* key:', key)
    print('* number:', len(group))
    print(group.head())

* key: ('First', 'female')
* number: 94
     age     sex  class      fare  survived
1   38.0  female  First   71.2833         1
3   35.0  female  First   53.1000         1
11  58.0  female  First   26.5500         1
31   NaN  female  First  146.5208         1
52  49.0  female  First   76.7292         1
* key: ('First', 'male')
* number: 122
     age   sex  class      fare  survived
6   54.0  male  First   51.8625         0
23  28.0  male  First   35.5000         1
27  19.0  male  First  263.0000         0
30  40.0  male  First   27.7208         0
34  28.0  male  First   82.1708         0
* key: ('Second', 'female')
* number: 76
     age     sex   class     fare  survived
9   14.0  female  Second  30.0708         1
15  55.0  female  Second  16.0000         1
41  27.0  female  Second  21.0000         0
43   3.0  female  Second  41.5792         1
53  29.0  female  Second  26.0000         1
* key: ('Second', 'male')
* number: 108
     age   sex   class  fare  survived
17   NaN  male  Second  13.0         1
20  35.0  male  Second  26.0         0
21  34.0  male  Second  13.0         1
33  66.0  male  Second  10.5         0
70  32.0  male  Second  10.5         0
* key: ('Third', 'female')
* number: 144
     age     sex  class     fare  survived
2   26.0  female  Third   7.9250         1
8   27.0  female  Third  11.1333         1
10   4.0  female  Third  16.7000         1
14  14.0  female  Third   7.8542         0
18  31.0  female  Third  18.0000         0
* key: ('Third', 'male')
* number: 347
     age   sex  class     fare  survived
0   22.0  male  Third   7.2500         0
4   35.0  male  Third   8.0500         0
5    NaN  male  Third   8.4583         0
7    2.0  male  Third  21.0750         0
12  20.0  male  Third   8.0500         0

- grouped_two 객체의 각 그룹에 mean() 메서드를 적용
- 데이터프레임 반환 => 키가 되는 2개의 열의 값으로부터 2중 멀티 인덱스가 지정

In [38]:
# grouped_two 그룹 객체에 연산 메서드 적용
average_two = grouped_two.mean()
print(average_two)
print('\n')
print(type(average_two))

                     age        fare  survived
class  sex
First  female  34.611765  106.125798  0.968085
       male    41.281386   67.226127  0.368852
Second female  28.722973   21.970121  0.921053
       male    30.740707   19.741782  0.157407
Third  female  21.750000   16.118810  0.500000
       male    26.507589   12.661633  0.135447


<class 'pandas.core.frame.DataFrame'>

- 멀티 인덱스를 이용하여 특정 그룹만을 골라서 추출
- get_group() 메서드 활용
- 인자로 전달하는 키는 튜플로 입력

In [39]:
# grouped_two 그룹 객체에서 개별 그룹 선택하기
group3f = grouped_two.get_group(('Third', 'female'))
print(group3f.head())

     age     sex  class     fare  survived
2   26.0  female  Third   7.9250         1
8   27.0  female  Third  11.1333         1
10   4.0  female  Third  16.7000         1
14  14.0  female  Third   7.8542         0
18  31.0  female  Third  18.0000         0

#### 그룹 연산 메서드(적용-결합 단계)

##### 데이터 집계

- 그룹 객체에 다양한 연산 적용 가능

In [ ]:
# 표준편차 데이터 집계(내장함수)
group객체.std()

In [40]:
# 6.15_groupby_agg.py

# 라이브러리 불러오기
import pandas as pd
import seaborn as sns

# titanic 데이터셋에서 age, sex 등 5개 열을 선택하여 데이터프레임 만들기
titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['age', 'sex', 'class', 'fare', 'survived']]

# class 열을 기준으로 분할
grouped = df.groupby(['class'])

# 각 그룹에 대한 모든 열의 표준편차를 집계하여 데이터프레임으로 반환
std_all = grouped.std()
print(std_all)
print('\n')
print(type(std_all))
print('\n')

# 각 그룹에 대한 fare 열의 표준편차를 집계하여 시리즈로 반환
std_fare = grouped.fare.std()
print(std_fare)
print('\n')
print(type(std_fare))

              age       fare  survived
class
First   14.802856  78.380373  0.484026
Second  14.001077  13.417399  0.500623
Third   12.495398  11.778142  0.428949


<class 'pandas.core.frame.DataFrame'>


class
First     78.380373
Second    13.417399
Third     11.778142
Name: fare, dtype: float64


<class 'pandas.core.series.Series'>

/var/folders/t0/85xt099562dflgf6nvxdqgl00000gn/T/ipykernel_29911/4250518260.py:15: FutureWarning: The default value of numeric_only in DataFrameGroupBy.std is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  std_all = grouped.std()

- 집계 연산을 처리하는 사용자 정의 함수를 그룹 객체에 적용하려면 agg() 메서드를 사용

In [ ]:
# agg() 메서드 데이터 집계
group객체.agg(매핑 함수)

In [41]:
# 그룹 객체에 agg() 메서드 적용 - 사용자 정의 함수를 인자로 전달
def min_max(x): # 최댓값 - 최솟값
    return x.max() - x.min()

# 각 그룹의 최댓값과 최솟값의 차이를 계산하여 그룹별로 집계
agg_minmax = grouped.agg(min_max)
print(agg_minmax.head())

          age      fare  survived
class
First   79.08  512.3292         1
Second  69.33   73.5000         1
Third   73.58   69.5500         1

/var/folders/t0/85xt099562dflgf6nvxdqgl00000gn/T/ipykernel_29911/2829162243.py:6: FutureWarning: ['sex'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  agg_minmax = grouped.agg(min_max)

- 동시에 여러 개의 함수를 사용하여 각 그룹별 데이터에 대한 집계 연산 처리 가능
- 각각의 열에 여러 개의 함수를 일괄 적용할 때는 리스트 형태로 인수를 전달
- 열마다 다른 종류의 함수를 적용하려면 {열 : 함수} 형태의 딕셔너리를 전달

In [ ]:
# 모든 열에 여러 함수를 매핑
group객체.agg([함수1, 함수2, 함수3,...])

# 각 열마다 다른 함수를 매핑
group객체.agg({'열1' : 함수1, '열2' : 함수2})

In [42]:
# 여러 함수를 각 열에 동일하게 적용하여 집계
agg_all = grouped.agg(['min', 'max'])
print(agg_all.head())
print('\n')

# 각 열마다 다른 함수를 적용하여 집계
agg_sep = grouped.agg({'fare' : ['min', 'max'], 'age' : 'mean'})
print(agg_sep.head())

         age           sex       fare           survived
         min   max     min   max  min       max      min max
class
First   0.92  80.0  female  male  0.0  512.3292        0   1
Second  0.67  70.0  female  male  0.0   73.5000        0   1
Third   0.42  74.0  female  male  0.0   69.5500        0   1


       fare                  age
        min       max       mean
class
First   0.0  512.3292  38.233441
Second  0.0   73.5000  29.877630
Third   0.0   69.5500  25.140620

- 2개의 함수를 리스트 형태로 입력하면 각 열에 대하여 2개 함수의 연산 결과를 각각 집계하여 다른 열로 구분하여 표시
- 함수명을 열 이름에 추가하여 2중 열 구조를 만든다

##### 그룹 연산 데이터 변환

- agg(): 각 그룹별 데이터에 연산을 위한 함수를 구분 적용; 그룹별로 연산 결과를 집계하여 반환
- transform(): 그룹별로 구분하여 각 원소에 함수를 적용; 각 원소의 본래 행 인덱스와 열 이름을 기준으로 연산 결과 반환
- 그룹 연산의 결과를 원본 데이터프레임과 같은 형태로 변형하여 정리

In [ ]:
# 데이터 변환 연산
group객체.transform(매핑 함수)

In [46]:
# 6.16_df_groupby_transform.py

# 생략 (6.15와 동일)

# 그룹별 age 열의 평균 집계 연산
age_mean = grouped.age.mean()
print(age_mean)
print('\n')

# 그룹별 age 열의 표준편파 집계 연산
age_std = grouped.age.std()
print(age_std)
print('\n')

# 그룹 객체의 age 열을 iteration으로 z-score를 계산하여 출력
for key, group in grouped.age:
    group_zscore = (group - age_mean.loc[key]) / age_std.loc[key]
    print('* origin:', key)
    print(group_zscore.head(3))
    print('\n')

class
First     38.233441
Second    29.877630
Third     25.140620
Name: age, dtype: float64


class
First     14.802856
Second    14.001077
Third     12.495398
Name: age, dtype: float64


* origin: First
1   -0.015770
3   -0.218434
6    1.065103
Name: age, dtype: float64


* origin: Second
9    -1.134029
15    1.794317
17         NaN
Name: age, dtype: float64


* origin: Third
0   -0.251342
2    0.068776
4    0.789041
Name: age, dtype: float64

- transform() 메서드를 사용하여 z-score로 직접 변환
- z-score를 계산하는 사용자 함수를 정의하고, transform() 메서드의 인자로 전달
- 각 그룹별 평균과 표준편차를 이용하여 각 원소의 z-score를 계산
- 반환되는 객체는 그룹별로 나누지 않고 원래 행 인덱스 순서로 정렬됨

In [47]:
# z-score를 계산하는 사용자 함수 정의
def z_score(x):
    return (x - x.mean()) / x.std()

# transforn() 메서드를 이용하여 age 열의 데이터를 z-score로 변환
age_zscore = grouped.age.transform(z_score)
print(age_zscore.loc[[1, 9, 0]]) # 1, 2, 3 그룹의 첫 데이터 확인(변환 결과)
print('\n')
print(len(age_zscore)) # transform 메서드 반환 값의 길이
print('\n')
print(age_zscore.loc[0:9]) # transform 메서드 반환 값 출력(첫 10개)
print('\n')
print(type(age_zscore)) # transform 메서드 반환 객체의 자료형

1   -0.015770
9   -1.134029
0   -0.251342
Name: age, dtype: float64


891


0   -0.251342
1   -0.015770
2    0.068776
3   -0.218434
4    0.789041
5         NaN
6    1.065103
7   -1.851931
8    0.148805
9   -1.134029
Name: age, dtype: float64


<class 'pandas.core.series.Series'>

##### 그룹 객체 필터링

- 그룹 객체에 filter() 메서드를 적용할 때 조건식을 가진 함수를 전달하면 조건이 참인 그룹만을 남김

In [ ]:
# 그룹 객체 필터링
group객체.filter(조건식 함수)

In [48]:
# 6.17_df_groupby_filter.py

# 생략 (6.16과 동일)

# 데이터 개수가 200개 이상인 그룹만을 필터링하여 데이터프레임으로 반환
grouped_filter = grouped.filter(lambda x : len(x) >= 200)
print(grouped_filter.head())
print('\n')
print(type(grouped_filter))

    age     sex  class     fare  survived
0  22.0    male  Third   7.2500         0
1  38.0  female  First  71.2833         1
2  26.0  female  Third   7.9250         1
3  35.0  female  First  53.1000         1
4  35.0    male  Third   8.0500         0


<class 'pandas.core.frame.DataFrame'>

In [50]:
# age 열으 평균이 30보다 작은 그룹만을 필터링하여 데이터프레임으로 반환
age_filter = grouped.filter(lambda x : x.age.mean() < 30)
print(age_filter.tail())
print('\n')
print(type(age_filter))

      age     sex   class    fare  survived
884  25.0    male   Third   7.050         0
885  39.0  female   Third  29.125         0
886  27.0    male  Second  13.000         0
888   NaN  female   Third  23.450         0
890  32.0    male   Third   7.750         0


<class 'pandas.core.frame.DataFrame'>

##### 그룹 객체에 함수 매핑

- apply() 메서드는 판다스 객체의 개별 원소를 특정 함수에 일대일로 매핑
- 사용자가 원하는 대부분의 연산을 그룹 객체에도 적용 가능

In [ ]:
# 범용 메서드
group객체.apply(매핑 함수)

- describe() 메서드를 적용하면 각 그룹별 데이터의 개수, 평균, 표준편차, 최소값, 최댓값 등 확인 가능

In [51]:
# 6.18_df_groupby_apply.py

# 생략 (6.17과 동일)

# 집계 : 각 그룹별 요약 통계 정보 집계
agg_grouped = grouped.apply(lambda x : x.describe())
print(agg_grouped)

                     age        fare    survived
class
First  count  186.000000  216.000000  216.000000
       mean    38.233441   84.154687    0.629630
       std     14.802856   78.380373    0.484026
       min      0.920000    0.000000    0.000000
       25%     27.000000   30.923950    0.000000
       50%     37.000000   60.287500    1.000000
       75%     49.000000   93.500000    1.000000
       max     80.000000  512.329200    1.000000
Second count  173.000000  184.000000  184.000000
       mean    29.877630   20.662183    0.472826
       std     14.001077   13.417399    0.500623
       min      0.670000    0.000000    0.000000
       25%     23.000000   13.000000    0.000000
       50%     29.000000   14.250000    0.000000
       75%     36.000000   26.000000    1.000000
       max     70.000000   73.500000    1.000000
Third  count  355.000000  491.000000  491.000000
       mean    25.140620   13.675550    0.242363
       std     12.495398   11.778142    0.428949
       min      0.420000    0.000000    0.000000
       25%     18.000000    7.750000    0.000000
       50%     24.000000    8.050000    0.000000
       75%     32.000000   15.500000    0.000000
       max     74.000000   69.550000    1.000000

In [52]:
# z-score를 계산하는 사용자 함수 정의
def z_score(x):
    return (x - x.mean()) / x.std()

age_xscore = grouped.age.apply(z_score) # 기본값 axis = 0
print(age_zscore.head())

0   -0.251342
1   -0.015770
2    0.068776
3   -0.218434
4    0.789041
Name: age, dtype: float64

/var/folders/t0/85xt099562dflgf6nvxdqgl00000gn/T/ipykernel_29911/3596970153.py:5: FutureWarning: Not prepending group keys to the result index of transform-like apply. In the future, the group keys will be included in the index, regardless of whether the applied function returns a like-indexed object.
To preserve the previous behavior, use

	>>> .groupby(..., group_keys=False)

To adopt the future behavior and silence this warning, use

	>>> .groupby(..., group_keys=True)
  age_xscore = grouped.age.apply(z_score) # 기본값 axis = 0

In [53]:
# 필터링 : age 열의 데이터 평균이 30보다 작은 그룹만을 필터링하여 출력
age_filter = grouped.apply(lambda x : x.age.mean() < 30)
print(age_filter)
print('\n')

for x in age_filter.index:
    if age_filter[x] == True:
        age_filter_df = grouped.get_group(x)
        print(age_filter_df.head())
        print('\n')

class
First     False
Second     True
Third      True
dtype: bool


     age     sex   class     fare  survived
9   14.0  female  Second  30.0708         1
15  55.0  female  Second  16.0000         1
17   NaN    male  Second  13.0000         1
20  35.0    male  Second  26.0000         0
21  34.0    male  Second  13.0000         1


    age     sex  class     fare  survived
0  22.0    male  Third   7.2500         0
2  26.0  female  Third   7.9250         1
4  35.0    male  Third   8.0500         0
5   NaN    male  Third   8.4583         0
7   2.0    male  Third  21.0750         0

### 멀티 인덱스

- groupby() 메서드에 여러 열을 리스트 형태로 전달하면 각 열들이 다중으로 행 인덱스를 구성
- 판다스는 행 인덱스를 여러 레벨로 구현할 수 있도록 멀티 인덱스(Multiindex)클래스를 지원

In [54]:
# 6.19_multi_index.py

# 생략 (6.18과 동일)

# class 열, swx 열을 기준으로 분할
grouped = df.groupby(['class', 'sex'])

# 그룹 객체에 연산 메서드 적용
gdf = grouped.mean()
print(gdf)
print('\n')
print(type(gdf))

                     age        fare  survived
class  sex
First  female  34.611765  106.125798  0.968085
       male    41.281386   67.226127  0.368852
Second female  28.722973   21.970121  0.921053
       male    30.740707   19.741782  0.157407
Third  female  21.750000   16.118810  0.500000
       male    26.507589   12.661633  0.135447


<class 'pandas.core.frame.DataFrame'>

In [55]:
# 멀티 인덱스에서 하나의 인덱스만 사용
# class 값이 First인 행을 선택하여 출력
print(gdf.loc['First'])

              age        fare  survived
sex
female  34.611765  106.125798  0.968085
male    41.281386   67.226127  0.368852

In [57]:
# 멀티 인덱스에서 두 개의 인덱스 사용
# loc 인덱서를 이용하교 인자로는 튜플 형태로 각 인덱스에서 찾는 값을 전달

# class 값이 First이고, sex 값이 frmale인 행을 선택하여 출력
print(gdf.loc[('First', 'female')])

age          34.611765
fare        106.125798
survived      0.968085
Name: (First, female), dtype: float64

In [58]:
# loc 인덱서 대신 xs 인덱서 사용
# sex 값이 male인 행을 선택하여 출력
print(gdf.xs('male', level = 'sex'))

              age       fare  survived
class
First   41.281386  67.226127  0.368852
Second  30.740707  19.741782  0.157407
Third   26.507589  12.661633  0.135447

### 피벗

- 판다스 pivot_table() 함수는 엑셀에서 사용하는 피벗테이블과 비슷한 기능을 처리
- 피벗테이블을 구성하는 4가지 요소(행 인덱스, 열 인덱스, 데이터 값, 데이터 집계 함수)에 적용할 데이터프레임의 열을 각각 지정하여 함수의 인자로 전달

In [61]:
# 6.20_pivot_table.py

# 라이브러리 불러오기
import pandas as pd
import seaborn as sns

# IPython 디스플레이 설정 변경
pd.set_option('display.max_columns', 10) # 출력할 최대 열의 개수
pd.set_option('display.max_colwidth', 20) # 출력할 열의 너비

# titanic 데이터셋에서 age, sex 등 5개 열을 선택하여 데이터프레임 만들기
titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['age', 'sex', 'class', 'fare', 'survived']]
print(df.head())
print('\n')

# 행, 열, 값, 집계에 사용할 열을 1개씩 지정 - 평균 집계
pdf1 = pd.pivot_table(df, # 피벗할 데이터프레임
                      index = 'class', # 행 위치에 들어갈 열
                      columns = 'sex', # 열 위치에 들어갈 열
                      values = 'age',  #데이터로 사용할 열
                      aggfunc = 'mean') # 데이터 집계 함수

print(pdf1.head())

    age     sex  class     fare  survived
0  22.0    male  Third   7.2500         0
1  38.0  female  First  71.2833         1
2  26.0  female  Third   7.9250         1
3  35.0  female  First  53.1000         1
4  35.0    male  Third   8.0500         0


sex        female       male
class
First   34.611765  41.281386
Second  28.722973  30.740707
Third   21.750000  26.507589

In [63]:
# 값에 적용하는 집계 함수 2개 이상 지정 가능 - 생존율, 생존자 수 집계
pdf2 = pd.pivot_table(df, # 피벗할 데이터프레임
                      index = 'class', # 행 위치에 들어갈 열
                      columns = 'sex', # 열 위치에 들어갈 열
                      values = 'survived', # 데이터로 사용할 열
                      aggfunc = ['mean', 'sum']) # 데이터 집계 함수

print(pdf2.head())

            mean              sum
sex       female      male female male
class
First   0.968085  0.368852     91   45
Second  0.921053  0.157407     70   17
Third   0.500000  0.135447     72   47

- pivot_table() 함수에 전달할 인자(행 인덱스, 열 위치, 데이터 값, 집계 함수)에 각각 2개 이상의 열 입력 가능

In [64]:
# 행, 열, 값에 사용할 열을 2개 이상 지정 가능 - 평균 나이, 최대 요금 집계
pdf3 = pd.pivot_table(df, # 피벗할 데이터프레임
                      index = ['class', 'sex'], # 행 위치에 들어갈 열
                      columns = 'survived', # 열 위치에 들어갈 열
                      values = ['age', 'fare'], # 데이터로 사용할 열
                      aggfunc = ['mean', 'max']) # 데이터 집계 함수

# IPython Console 디스플레이 옵션 설정
pd.set_option('display.max_columns', 10) # 출력할 열의 최대 개수
print(pdf3.head())
print('\n')

# 행, 열 구조 살펴보기
print(pdf3.index)
print(pdf3.columns)

                    mean                                      max        \
                     age                   fare               age
survived               0          1           0           1     0     1
class  sex
First  female  25.666667  34.939024  110.604167  105.978159  50.0  63.0
       male    44.581967  36.248000   62.894910   74.637320  71.0  80.0
Second female  36.000000  28.080882   18.250000   22.288989  57.0  55.0
       male    33.369048  16.022000   19.488965   21.095100  70.0  62.0
Third  female  23.818182  19.329787   19.773093   12.464526  48.0  63.0


                 fare
survived            0         1
class  sex
First  female  151.55  512.3292
       male    263.00  512.3292
Second female   26.00   65.0000
       male     73.50   39.0000
Third  female   69.55   31.3875


MultiIndex([( 'First', 'female'),
            ( 'First',   'male'),
            ('Second', 'female'),
            ('Second',   'male'),
            ( 'Third', 'female'),
            ( 'Third',   'male')],
           names=['class', 'sex'])
MultiIndex([('mean',  'age', 0),
            ('mean',  'age', 1),
            ('mean', 'fare', 0),
            ('mean', 'fare', 1),
            ( 'max',  'age', 0),
            ( 'max',  'age', 1),
            ( 'max', 'fare', 0),
            ( 'max', 'fare', 1)],
           names=[None, None, 'survived'])

- index 속성과 columns 속성에는 3가지 속성이 있음
- levels 속성을 보면 행 인덱스는 2개의 열이 사용되어 2중 구조
- 열은 3중 구조로 이루어짐

- xs 인덱서는 기본값으로 행 인덱스에 접근하고, 축 값은 axis = 0으로 자동 설정

In [65]:
# xs 인덱서 사용 - 행 선택(default: axis = 0)
print(pdf3.xs('First')) # 행 인덱스가 First인 행을 선택

               mean                                      max                \
                age                   fare               age          fare
survived          0          1           0           1     0     1       0
sex
female    25.666667  34.939024  110.604167  105.978159  50.0  63.0  151.55
male      44.581967  36.248000   62.894910   74.637320  71.0  80.0  263.00



survived         1
sex
female    512.3292
male      512.3292

In [66]:
print(pdf3.xs(('First', 'female'))) # 행 인덱스가 ('First', 'female')인 행을 선택

            survived
mean  age   0            25.666667
            1            34.939024
      fare  0           110.604167
            1           105.978159
max   age   0            50.000000
            1            63.000000
      fare  0           151.550000
            1           512.329200
Name: (First, female), dtype: float64

In [67]:
# 행 인덱스 레벨 직접 지정
print(pdf3.xs('male', level = 'sex')) # 행 인덱스의 sex 레벨이 male인 행을 선택

               mean                                    max                \
                age                  fare              age          fare
survived          0          1          0          1     0     1       0
class
First     44.581967  36.248000  62.894910  74.637320  71.0  80.0  263.00
Second    33.369048  16.022000  19.488965  21.095100  70.0  62.0   73.50
Third     27.255814  22.274211  12.204469  15.579696  74.0  45.0   69.55



survived         1
class
First     512.3292
Second     39.0000
Third      56.4958

In [68]:
print(pdf3.xs(('Second', 'male'), level = [0, 'sex'])) # Second, male인 행을 선택

                  mean                               max
                   age               fare            age        fare
survived             0       1          0        1     0     1     0     1
class  sex
Second male  33.369048  16.022  19.488965  21.0951  70.0  62.0  73.5  39.0

In [69]:
# xs 인덱서를 이용하여 열 인덱스에 접근하기 위해서는 축 값을 axis = 1로 설정
# xs 인덱서 사용 - 열 선택(axis = 1 설정)
print(pdf3.xs('mean', axis = 1)) # 열 인덱스가 mean인 데이터 선택

                     age                   fare
survived               0          1           0           1
class  sex
First  female  25.666667  34.939024  110.604167  105.978159
       male    44.581967  36.248000   62.894910   74.637320
Second female  36.000000  28.080882   18.250000   22.288989
       male    33.369048  16.022000   19.488965   21.095100
Third  female  23.818182  19.329787   19.773093   12.464526
       male    27.255814  22.274211   12.204469   15.579696

In [70]:
# 그룹별 집계 결과만을 추출하여 반환
print(pdf3.xs(('mean', 'age'), axis = 1)) # 열 인덱스가 ('mean', 'age')인 데이터 선택

survived               0          1
class  sex
First  female  25.666667  34.939024
       male    44.581967  36.248000
Second female  36.000000  28.080882
       male    33.369048  16.022000
Third  female  23.818182  19.329787
       male    27.255814  22.274211

In [71]:
# 열 인덱스 레벨 직접 지정
print(pdf3.xs(1, level = 'survived', axis = 1)) # survived 레벨이 1인 데이터 선택

                    mean               max
                     age        fare   age      fare
class  sex
First  female  34.939024  105.978159  63.0  512.3292
       male    36.248000   74.637320  80.0  512.3292
Second female  28.080882   22.288989  55.0   65.0000
       male    16.022000   21.095100  62.0   39.0000
Third  female  19.329787   12.464526  63.0   31.3875
       male    22.274211   15.579696  45.0   56.4958

In [72]:
print(pdf3.xs(('max', 'fare', 0),
              level = [0, 1, 2], axis = 1)) # max, fare, survived = 0인 데이터 선택

                  max
                 fare
survived            0
class  sex
First  female  151.55
       male    263.00
Second female   26.00
       male     73.50
Third  female   69.55
       male     69.55